conf/tbo-sample.xml

REQUEST
<soap:Envelope xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <hot:Credentials UserName="RoyalConnectTravelsTest" Password="Roy@45262537"></hot:Credentials>
        <wsa:Action>http://TekTravel/HotelBookingApi/AvailabilityandPricing</wsa:Action>
        <wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
    </soap:Header>
    <soap:Body>
        <hot:AvailabilityAndPricingRequest>
            <hot:ResultIndex>1</hot:ResultIndex>
            <hot:HotelCode>1163781</hot:HotelCode>
            <hot:SessionId>9d58ea1c-f99f-4036-a343-77121666033c</hot:SessionId>
            <hot:OptionsForBooking>
                <hot:FixedFormat>false</hot:FixedFormat>
                <hot:RoomCombination>
                    <hot:ResultIndex>1</hot:ResultIndex><hot:ResultIndex>2</hot:ResultIndex>
                </hot:RoomCombination>
            </hot:OptionsForBooking>
        </hot:AvailabilityAndPricingRequest>
    </soap:Body>
</soap:Envelope>




RESPONSE
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
<s:Header>
    <a:Action s:mustUnderstand="1">http://www.w3.org/2005/08/addressing/fault</a:Action>
</s:Header>
<s:Body>
    <s:Fault>
        <s:Code>
            <s:Value>s:Sender</s:Value>
            <s:Subcode>
                <s:Value>a:ActionNotSupported</s:Value>
            </s:Subcode>
        </s:Code>
        <s:Reason>
            <s:Text xml:lang="en-GB">The message with Action 'http://TekTravel/HotelBookingApi/AvailabilityandPricing' cannot be processed at the receiver, due to a ContractFilter mismatch at the EndpointDispatcher. This may be because of either a contract mismatch (mismatched Actions between sender and receiver) or a binding/security mismatch between the sender and the receiver.  Check that sender and receiver have the same contract and the same binding (including security requirements, e.g. Message, Transport, None).</s:Text>
        </s:Reason>
    </s:Fault>
</s:Body>
</s:Envelope>